import * as React from "react";
import About from '../components/About/About';
import sawa from '../images/sawa.jpg';
import './Overview.scss';

class Overview extends React.Component {
    render() {
        const header= 'מה אנחנו?';
        const text= 'תכנית \'סאווה\' سوا​, בתרגום מערבית \'ביחד\', היא תכנית סיוע לסטודנטים בני החברה הערבית הלומדים באוניברסיטת תל-אביב. התכנית מתמקדת במתן תמיכה לימודית, אישית ורגשית לסטודנטים במהלך לימודיהם. מטרת התכנית היא לסייע לסטודנטים להצליח בלימודיהם האקדמיים, תוך הגברת תחושת שייכות אישית וחברתית, ולעודד צעירים ערבים נוספים להגיע לאוניברסיטה ולסיים בהצלחה את לימודיהם בה. \n' +
            '\n' +
            '\n' +
            '​מערך התמיכה  לסטודנטים בני החברה הערבית כולל:\n' +
            '\n' +
            'ליווי תמיכה ויעוץ בפתרון בעיות אקדמיות, אישיות וחברתיות ע"י עו"ס בן החברה הערבית\n' +
            'הכנה קדם אקדמית - מכינות \'צעד לפני כולם\'\n' +
            'חונכות אישית לסטודנטים שנה א\'\n' +
            'תמיכה אקדמית באמצעות קבוצות למידה ותרגול פרטני\n' +
            'פעילויות העשרה חברתיות במועדון התרבות\n' +
            'אפשרות לסיוע במימון שירותים שונים במהלך הלימודים\n' +
            'תיווך מול הפקולטות בעניינים אקדמאים\n' +
            'זכויות לימודיות לסטודנטים וסטודנטיות בני החברה הערבית:\n' +
            '\n' +
            'הארכת זמן במבחנים - תוספת זמן של 30 דקות לבחינה.\n' +
            'שימוש במילון - סטודנטים אשר נבחנו בבחינות הבגרות בשפה הערבית, יכולים להשתמש במילון ספר בערבית (במהלך בחינה הכתובה בשפה העברית).';
        return (
            <React.Fragment>
                <div className='content'>
                    <img id='homepage_image' src={sawa} alt='home page'/>
                    <About
                        header={header}
                        text={text}
                    />
                </div>
            </React.Fragment>
        );
    }
}

export default Overview;